Os comandos abaixo carregam o famoso dataset do titanic no objeto chamado *df*. Explore a tabela e responda as seguintes questões **sempre colocando o código em Python utilizado para chegar às respostas.**

1) Quantas pessoas sobreviveram ao acidente?
2) Quantas criancas menores de 12 anos sobreviveram ao acidente?
3) Quantas pessoas embarcaram nos portos de Southampton OU Queenstow?
4) Crie um objeto chamado **passageiras** que seleciona somente as passageiras.
5) Crie um objeto chamado **criancas_cherbourg** que seleciona as crianças com menos de 12 anos E que embarcaram na cidade de Cherbourg.
6) Crie um objeto chamado **titanic_menor** e selecione as colunas de *nome*, *idade*, *classe* e *embarque*
7) Supondo que o valor da tarifa no dataset está em libras, e que 1£ = R$ 6.43, crie uma nova coluna chamada **tarifa_real** que contenha a tarifa de embarque em reais.
8) Agrupe pela coluna sobreviveu e calcule o número de passageiros por grupo (sim/nao)
9) Agrupe pelo local de embarque e calcule a média e a mediana da tarifa de cada grupo.
10) Agrupe pela classe e conte a quantidade de pessoas por classe
11) Agrupe pela classe e pela coluna sobreviveu e conte a quantidade de pessoas que sobreviveu de acordo com cada classe. Quem sobreviveu mais? A classe mais alta ou a mais baixa?
12) Agrupe pelo sexo e pela coluna sobreviveu e conte a quantidade de pessoas que sobreviveram de acordo com o sexo. Quem sobreviveu mais? Homens ou mulheres?

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../dados/titanic.csv')
df

,id_passageiro,sobreviveu,classe,nome,sexo,idade,irmaos_conjuge,pais_criancas,passagem,tarifa,cabine,embarque
0,1,nao,3,"Braund, Mr. Owen Harris",masculino,22.0,1,0,A/5 21171,7.2500,NaN,Southampton
1,2,sim,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",feminino,38.0,1,0,PC 17599,71.2833,C85,Cherbourg
2,3,sim,3,"Heikkinen, Miss. Laina",feminino,26.0,0,0,STON/O2. 3101282,7925.0000,NaN,Southampton
3,4,sim,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",feminino,35.0,1,0,113803,53.1000,C123,Southampton
4,5,nao,3,"Allen, Mr. William Henry",masculino,35.0,0,0,373450,8.0500,NaN,Southampton
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,nao,2,"Montvila, Rev. Juozas",masculino,27.0,0,0,211536,13.0000,NaN,Southampton
887,888,sim,1,"Graham, Miss. Margaret Edith",feminino,19.0,0,0,112053,30.0000,B42,Southampton
888,889,nao,3,"Johnston, Miss. Catherine Helen ""Carrie""",feminino,NaN,1,2,W./C. 6607,23.4500,NaN,Southampton
889,890,sim,1,"Behr, Mr. Karl Howell",masculino,26.0,0,0,111369,30.0000,C148,Cherbourg
890,891,nao,3,"Dooley, Mr. Patrick",masculino,32.0,0,0,370376,7.7500,NaN,Queenstow

In [4]:
# questão 1
df["sobreviveu"].value_counts()
# 342 pessoas sobreviveram

nao    549
sim    342
Name: sobreviveu, dtype: int64

In [6]:
df["sobreviveu"].loc[(df["sobreviveu"] == 'sim')]

1      sim
2      sim
3      sim
8      sim
9      sim
      ...
875    sim
879    sim
880    sim
887    sim
889    sim
Name: sobreviveu, Length: 342, dtype: object

In [11]:
#questão 2
df2 = df.loc[(df['idade'] < 12.0) & (df['sobreviveu'] == "sim")]

In [10]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39 entries, 10 to 869
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_passageiro   39 non-null     int64
 1   sobreviveu      39 non-null     object
 2   classe          39 non-null     int64
 3   nome            39 non-null     object
 4   sexo            39 non-null     object
 5   idade           39 non-null     float64
 6   irmaos_conjuge  39 non-null     int64
 7   pais_criancas   39 non-null     int64
 8   passagem        39 non-null     object
 9   tarifa          39 non-null     float64
 10  cabine          9 non-null      object
 11  embarque        39 non-null     object
dtypes: float64(2), int64(4), object(6)
memory usage: 4.0+ KB

In [12]:
df.loc[(df['idade'] < 12.0) & (df['sobreviveu'] == "sim")]
#39 pessoas com menos de 12 anos sobreviveram

,id_passageiro,sobreviveu,classe,nome,sexo,idade,irmaos_conjuge,pais_criancas,passagem,tarifa,cabine,embarque
10,11,sim,3,"Sandstrom, Miss. Marguerite Rut",feminino,4.00,1,1,PP 9549,16.7000,G6,Southampton
43,44,sim,2,"Laroche, Miss. Simonne Marie Anne Andree",feminino,3.00,1,2,SC/Paris 2123,41.5792,NaN,Cherbourg
58,59,sim,2,"West, Miss. Constance Mirium",feminino,5.00,1,2,C.A. 34651,27.7500,NaN,Southampton
78,79,sim,2,"Caldwell, Master. Alden Gates",masculino,0.83,0,2,248738,29.0000,NaN,Southampton
165,166,sim,3,"Goldsmith, Master. Frank John William ""Frankie""",masculino,9.00,0,2,363291,20525.0000,NaN,Southampton
172,173,sim,3,"Johnson, Miss. Eleanor Ileen",feminino,1.00,1,1,347742,11.1333,NaN,Southampton
183,184,sim,2,"Becker, Master. Richard F",masculino,1.00,2,1,230136,39.0000,F4,Southampton
184,185,sim,3,"Kink-Heilmann, Miss. Luise Gretchen",feminino,4.00,0,2,315153,22025.0000,NaN,Southampton
193,194,sim,2,"Navratil, Master. Michel M",masculino,3.00,1,1,230080,26.0000,F2,Southampton
233,234,sim,3,"Asplund, Miss. Lillian Gertrud",feminino,5.00,4,2,347077,31.3875,NaN,Southampton
237,238,sim,2,"Collyer, Miss. Marjorie ""Lottie""",feminino,8.00,0,2,C.A. 31921,26.2500,NaN,Southampton
261,262,sim,3,"Asplund, Master. Edvin Rojj Felix",masculino,3.00,4,2,347077,31.3875,NaN,Southampton
305,306,sim,1,"Allison, Master. Hudson Trevor",masculino,0.92,1,2,113781,151.5500,C22 C26,Southampton
340,341,sim,2,"Navratil, Master. Edmond Roger",masculino,2.00,1,1,230080,26.0000,F2,Southampton
348,349,sim,3,"Coutts, Master. William Loch ""William""",masculino,3.00,1,1,C.A. 37671,15.9000,NaN,Southampton
381,382,sim,3,"Nakid, Miss. Maria (""Mary"")",feminino,1.00,0,2,2653,15.7417,NaN,Cherbourg
407,408,sim,2,"Richards, Master. William Rowe",masculino,3.00,1,1,29106,18.7500,NaN,Southampton
445,446,sim,1,"Dodge, Master. Washington",masculino,4.00,0,2,33638,81.8583,A34,Southampton
448,449,sim,3,"Baclini, Miss. Marie Catherine",feminino,5.00,2,1,2666,19.2583,NaN,Cherbourg
469,470,sim,3,"Baclini, Miss. Helene Barbara",feminino,0.75,2,1,2666,19.2583,NaN,Cherbourg
479,480,sim,3,"Hirvonen, Miss. Hildur E",feminino,2.00,0,1,3101298,12.2875,NaN,Southampton
489,490,sim,3,"Coutts, Master. Eden Leslie ""Neville""",masculino,9.00,1,1,C.A. 37671,15.9000,NaN,Southampton
530,531,sim,2,"Quick, Miss. Phyllis May",feminino,2.00,1,1,26360,26.0000,NaN,Southampton
535,536,sim,2,"Hart, Miss. Eva Miriam",feminino,7.00,0,2,F.C.C. 13529,26.2500,NaN,Southampton
549,550,sim,2,"Davies, Master. John Morgan Jr",masculino,8.00,1,1,C.A. 33112,36.7500,NaN,Southampton
618,619,sim,2,"Becker, Miss. Marion Louise",feminino,4.00,2,1,230136,39.0000,F4,Southampton
644,645,sim,3,"Baclini, Miss. Eugenie",feminino,0.75,2,1,2666,19.2583,NaN,Cherbourg
691,692,sim,3,"Karun, Miss. Manca",feminino,4.00,0,1,349256,13.4167,NaN,Cherbourg
720,721,sim,2,"Harper, Miss. Annie Jessie ""Nina""",feminino,6.00,0,1,248727,33.0000,NaN,Southampton
750,751,sim,2,"Wells, Miss. Joan",feminino,4.00,1,1,29103,23.0000,NaN,Southampton
751,752,sim,3,"Moor, Master. Meier",masculino,6.00,0,1,392096,12475.0000,E121,Southampton
755,756,sim,2,"Hamalainen, Master. Viljo",masculino,0.67,1,1,250649,14.5000,NaN,Southampton
777,778,sim,3,"Emanuel, Miss. Virginia Ethel",feminino,5.00,0,0,364516,12475.0000,NaN,Southampton
788,789,sim,3,"Dean, Master. Bertram Vere",masculino,1.00,1,2,C.A. 2315,20575.0000,NaN,Southampton
802,803,sim,1,"Carter, Master. William Thornton II",masculino,11.00,1,2,113760,120.0000,B96 B98,Southampton
803,804,sim,3,"Thomas, Master. Assad Alexander",masculino,0.42,0,1,2625,8.5167,NaN,Cherbourg
827,828,sim,2,"Mallet, Master. Andre",masculino,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,Cherbourg
831,832,sim,2,"Richards, Master. George Sibley",masculino,0.83,1,1,29106,18.7500,NaN,Southampton
869,870,sim,3,"Johnson, Master. Harold Theodor",masculino,4.00,1,1,347742,11.1333,NaN,Southampton

In [21]:
#questão3
df["embarque"].loc[(df["embarque"] == "Southampton") | (df["embarque"] == "Queenstow")].count()

721

In [31]:
#questão 4
passageiras: (df['sexo'] == "feminino")

In [17]:
# questão 5
criancas_cherbourg = [(df['idade'] < 12.0) & (df['embarque'] == "Cherbourg")]

In [16]:
# questão 6
titanic_menor = df[['nome','idade','classe','embarque']]

In [14]:
#questão 7
df['tarifa_real'] = df['tarifa']*6.43
df.head()

,id_passageiro,sobreviveu,classe,nome,sexo,idade,irmaos_conjuge,pais_criancas,passagem,tarifa,cabine,embarque,tarifa_real
0,1,nao,3,"Braund, Mr. Owen Harris",masculino,22.0,1,0,A/5 21171,7.2500,NaN,Southampton,46.617500
1,2,sim,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",feminino,38.0,1,0,PC 17599,71.2833,C85,Cherbourg,458.351619
2,3,sim,3,"Heikkinen, Miss. Laina",feminino,26.0,0,0,STON/O2. 3101282,7925.0000,NaN,Southampton,50957.750000
3,4,sim,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",feminino,35.0,1,0,113803,53.1000,C123,Southampton,341.433000
4,5,nao,3,"Allen, Mr. William Henry",masculino,35.0,0,0,373450,8.0500,NaN,Southampton,51.761500

In [4]:
#questão 8
df.groupby(['sobreviveu']).count()

,id_passageiro,classe,nome,sexo,idade,irmaos_conjuge,pais_criancas,passagem,tarifa,cabine,embarque
sobreviveu,,,,,,,,,,,
nao,549,549,549,549,424,549,549,549,549,68,549
sim,342,342,342,342,290,342,342,342,342,136,340

In [34]:
#questão 9
df[['embarque', 'tarifa']].groupby('embarque').agg(['mean'])

                   tarifa
                     mean
embarque
Cherbourg    12709.345662
Queenstow     2002.842913
Southampton   2015.306986

In [15]:
# questão 10
df.groupby(['classe']).count()

,id_passageiro,sobreviveu,nome,sexo,idade,irmaos_conjuge,pais_criancas,passagem,tarifa,cabine,embarque
classe,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [ ]:
# questão 11

In [ ]:
# questão 12